// src/data/menuData.js

export const fullMenuItems = [
  {
    category: '에버그린로드',
    subItems: [
      '오로라에디션한정판',
      {
        name: '칼레이도시리즈',
        subSubItems: ['칼레이도 RS/GT시리즈', '칼레이도스피닝 시리즈']
      },
      '오리온시리즈', '라이트카발시리즈(2피스)', '페이즈시리즈', '팩트 FACT시리즈', '볼락로드(슈페리어)',
      '에깅로드[오징어]', '지깅로드', '참돔로드(타이러버)', '알티잔[송어]', '농어로드', '단종/헤라클레스시리즈', '30주년 에어리얼 모델', '단종/칼레이도(토너먼트/블랙)'
    ],
  },
  {
    category: '송어/쏘가리',
    subItems: ['쏘가리로드', '송어로드'],
  },
  {
    category: '릴 REEL/소품',
    subItems: [{name:'베이트릴', subSubItems: ['시마노', '다이와']},{name:'스피닝릴', subSubItems: ['시마노', '다이와','에버그린']},{name:'전동릴', subSubItems: ['시마노', '다이와']},{name:'선상릴 / 지깅릴', subSubItems: ['시마노', '다이와']},'릴소품'],
  },
  {
    category: '라인/소품',
    subItems: [{name:'카본라인', subSubItems: ['단라인', '에버그린','선라인', '시가라인']},{name:'모노라인', subSubItems: ['에버그린', '단라인', '썬라인']},{name:'합사라인', subSubItems: ['에버그린', '썬라인']},'쇼크리더','라인소품'],
  },
  {
    category: '윔/소프트루어',
    subItems: [{name:'배스', subSubItems: ['에버그린', '사와무라','이마가츠', '줌ZOOM', '게리야마모토', '다미끼']},'송어/쏘가리'],
  },
  {
    category: '하드루어',
    subItems: ['에기/팁런에기/이카메탈',{name:'미노우', subSubItems: ['에버그린','이마가츠', '메가배스', '다미끼', '요즈리']},{name:'탑워터', subSubItems: ['에버그린', '이마가츠', 
      '더블에이치', '뎁스', '쟈칼', '헤돈', '다미끼']},{name:'체터베이트/버즈베이트', subSubItems: ['에버그린', '다미끼']},
      {name:'스피너베이트스위밍투루퍼', subSubItems: ['에버그린', '이마가츠']},
      {name:'크랭크베이트', subSubItems: ['에버그린', '이마가츠', '다미끼']},
      {name:'바이브레이셔', subSubItems: ['에버그린', '다미끼', '이마가츠']},
      {name:'러버지그/스몰러버지그', subSubItems: ['에버그린']},
       '메타지그/스푼/스피너',
      {name:'개구리', subSubItems: ['에버그린', '테켈[Teckel]']},
      {name:'빅베이트', subSubItems: ['에버그린', '이마가츠', '메드네스[COMMANDS]']},
    ],
  },
  {
    category: '바늘/씽커/채비',
    subItems: [{name:'윔/다운샷/카이젤/와키', subSubItems: ['에버그린','데코이','오너[OWNER]','가마가츠','피나[FINA]','다마끼','레토피아','워터맨','odz']},'플레쉬스위머/웨이트훅','지그헤드/풋볼','트레블/트레일러/더블','씽 커','비드/스냅/도래','스플릿링/고무링'],
  },
  {
    category: '의류/모자/잡화',
    subItems: ['낚시의류/에버그린의류','에버그린모자','장갑/토시/버프(넥워머)','구명조끼/벨트/봄베','장화/바지장화'],
  },
  {
    category: '태클박스/가방',
    subItems: [{name:'태클박스', subSubItems: ['에버그린','메이호/버서스']},'가방 / 바칸','릴가방/파우치','쿨러/보조가방'],
  },
  {
    category: '낚시소품',
    subItems: ['라인커터/핀온릴/렌턴','일렉트릭와이어지퍼','플라이어/글립/피징바늘','루어회수기/줄자/꿰미','로드커버/훅키퍼,훅커버/벨트','스티커/데칼','릴오일 릴튜닝노브&헨들'],
  },
  {
    category: '바다낚시대',
    subItems: ['뽈락낚시대','라이트지깅 낚시대','에깅낚시대','타이러버낚시대'],
  },
  {
    category: '바다낚시채비',
    subItems: ['에기/이카메탈', '한치채비'],
  },
  
];